{
    "MainNav": [
        {"path": "home", "linkName": "Plot 1 "}, 
        {"path": "page2", "linkName": "  Plot 2 "}, 
        {"path": "page3", "linkName": "  Plot 3 "}],
        


"Pages": [
    {"pageName": "home", "content": "<h1>Friday the 13th</h1> <div class='sectionOne'><p>In 1958 at Camp Crystal Lake, counselors Barry and Claudette sneak inside a storage cabin to have sex, where an unseen assailant murders them. Twenty-one years later, camp counselor Annie Phillips is given a lift halfway to the reopened Camp Crystal Lake by a truck driver named Enos, despite an elderly man named Crazy Ralph warning her. While driving, Enos warns Annie about the camp's past, informing her about a young boy who drowned at Crystal Lake in 1957, the two murders in 1958, several fires after that, and poisoned water in 1962. After being dropped off, she hitches another ride from an unseen person, who chases her into the woods and slashes her throat.</p></div><div class= 'sectionTwo'><p>At the camp, counselors Ned Rubenstein, Jack Burrell, Bill Brown, Marcie Cunningham, Brenda Jones, and Alice Hardy, along with the owner Steve Christy, refurbish the cabins and facilities. As a thunderstorm approaches, Steve leaves the campground to stock supplies. Ned sees someone walk into a cabin and follows. While Jack and Marcie have sex in one of the cabin's bunk beds, they are unaware of Ned's body above them, with his throat slit. When Marcie leaves to use the bathroom, Jack's throat is pierced with an arrow from beneath the bed. The killer follows Marcie into the bathrooms and slams an axe into her face. Brenda hears a child's voice calling for help and ventures outside to the archery range, where the lights turn on. Later, Steve returns and recognizes the unseen killer, who stabs him.</p></div><div class='sectionThree'><p>Worried by their friends' disappearances, Alice and Bill leave the main cabin to investigate. They find the axe in Brenda's bed, the phones disconnected, and the cars inoperable. When the power goes out, Bill goes to check on the generator. Alice heads out to look for him and finds his body pinned with arrows to the generator room's door. She flees to the main cabin to hide, only to be traumatized further when Brenda's body is thrown through the window. Soon after, Alice sees a vehicle pull up and rushes outside, thinking it is Steve. Instead, she is greeted by a middle-aged woman named Pamela Voorhees, who claims to be an old friend of Steve and his family.</p></div><div class='sectionFour'><p>She reveals that her son, Jason Voorhees was the young boy who drowned in 1957, blaming his death on the counselors who were supposed to be watching him, but they instead were having sex. Revealing herself as the killer, she attempts to kill Alice, but Alice knocks her out. At the shore, she tries to kill her again with a machete, but Alice gains the advantage and decapitates her. Exhausted, Alice boards and falls asleep inside a canoe, which floats out on Crystal Lake. Just as she wakes up and Jason's corpse attacks her, she awakens inside a hospital with a police sergeant and medical staff tending to her. When Alice asks about Jason, the sergeant says there was no sign of any boy. She says: 'Then he's still there', as the lake is shown at peace.</p></div>"},
    {"pageName": "page2", "content":  "<h1>Nightmare On Elm Street</h1> <div class='sectionOne'><p>In March 1981, at Springwood, Ohio, Tina Gray awakens from a nightmare wherein she is attacked by a disfigured man in decayed clothes who wears a blade-fixed work glove on his right hand. Her mother points out four mysterious slashes on her nightgown. The following morning she is consoled by her best friend, Nancy Thompson, and Nancy's boyfriend, Glen Lantz. The two stay at Tina's house when Tina's mother goes out of town, but their sleepover is interrupted by Tina's boyfriend, Rod Lane. When Tina falls asleep, she dreams of being chased by the disfigured man. Rod is awoken by Tina's thrashing and sees her dragged and fatally slashed by an unseen force; he flees as Nancy and Glen awaken to find Tina covered in blood and dead.</p></div><div class= 'sectionTwo'><p>The next day, Rod is arrested by Nancy's father, Lieutenant Don Thompson, despite his pleas of innocence. At school, Nancy falls asleep in class. While masquerading as Tina, the man chases her to the boiler room where she is cornered and burns her arm on a pipe. The burn startles her awake in class and she notices a burn mark on her arm. At home, Nancy falls asleep in the bathtub and is nearly drowned by the man. Nancy goes to Rod at the police station, who tells her about what happened to Tina and his own similar dreams; this makes Nancy believe that the man is responsible for Tina's death. Nancy invites Glen to watch over her as she falls asleep. In her dream, she sees the man prepare to kill Rod in his cell, but then he turns his attention towards her. Nancy runs away and wakes up when her alarm clock goes off. The man kills Rod by wrapping bed sheets around his neck like a noose. Nancy and Glen find his body hanging in his cell. At Rod's funeral, Nancy's parents become worried when she describes her dream. Her mother, Marge, takes her to a sleep disorders clinic, where, in a dream, Nancy grabs the man's fedora and pulls it from the dream into reality.</p></div><div class='sectionThree'><p>Marge begins to drink and smoke heavily and adds bars the windows at home. She reveals to Nancy that the man, Fred Krueger, was an insane child murderer who was released on a technicality and then burned alive by Marge, Don, and other parents (who lived on their street) seeking vigilante justice. Nancy realizes that Krueger, now a vengeful ghost, desires revenge and to satiate his psychopathic needs. She tries to call Glen to warn him, but his father prevents her from speaking to him. Glen falls asleep and is sucked into his bed by Krueger, and a large fountain of blood is released in his room. Now alone, Nancy puts Marge to sleep and asks Don, who is across the street investigating Glen's death, to break into the house in twenty minutes. She rigs booby traps around the house, and grabs Krueger out of the dream and into the real world. The booby traps affect Krueger enough that Nancy is able to light him on fire with a Molotov cocktail and lock him in the basement. Nancy rushes to the door for help. The police arrive to find that Krueger has escaped from the basement. Nancy and Don go upstairs to find a burning Krueger smothering Marge in her bedroom. After Don puts out the fire, Krueger and Marge vanish into the bed.</p></div><div class='sectionFour'><p>When Don leaves the room, Krueger rises from the bed behind Nancy. Realizing that Krueger is powered by his victim's fear of him, Nancy calmly turns her back to him and Krueger evaporates when he attempts to lunge at her. Nancy steps outside into a bright and foggy morning where all of her friends and her mother are still alive. As she gets into Glen's convertible to go to school, the top (patterned like Krueger's sweater) suddenly comes down and locks them in as the car drives uncontrollably down the street. Three girls in white dresses playing jump rope are heard chanting Krueger's nursery rhyme as Marge is grabbed by Krueger through the front door window.</p></div>"},
    {"pageName": "page3", "content": "<h1>Halloween</h1> <div class='sectionOne'><p>In 1963, on Halloween night in Haddonfield, Illinois, six year-old Michael Myers inexplicably stabs his older sister Judith to death with a kitchen knife in their home, and is incarcerated at Smith's Grove sanitarium. Fifteen years later, Michael's psychiatrist Dr. Samuel Loomis and his colleague Marion Chambers arrive at the sanitarium to escort Michael to court. Michael escapes by stealing their car and returns to Haddonfield, killing a mechanic for his coveralls, as well as stealing a white mask and knives from a local hardware store.</p></div><div class= 'sectionTwo'><p>On Halloween, when high school student Laurie Strode drops off a key at his former home so her father can sell it, Michael stalks her throughout the day which she notices, but her friends Annie Brackett and Lynda Van der Klok dismiss her concerns. Loomis arrives in Haddonfield in search of Michael, and finds Judith's tombstone missing from the local cemetery. He meets with Annie's father, Sheriff Leigh Brackett, and they both investigate Michael's house, where Loomis tells Sheriff Brackett of the danger Michael poses. Sheriff Brackett, while doubtful of Michael's danger, patrols the streets, while Loomis waits at the house, expecting Michael to return.</p></div><div class='sectionThree'><p>Later that night, Laurie babysits Tommy Doyle, while Annie babysits Lindsey Wallace just across the street, unaware that Michael has followed them. When Annie's boyfriend, Paul, calls her to come and pick him up, she takes Lindsey over to the Doyle house to spend the night with Laurie and Tommy. Before Annie can leave in her car, Michael, who hid in the back seat, strangles her and slits her throat. Soon after, Lynda and her boyfriend, Bob Simms, arrive at the Wallace house. After having sex, Bob goes downstairs to get a beer for Lynda, where Michael stabs him. Michael then poses as Bob in a ghost costume and confronts Lynda, who teases him to no effect. Annoyed, Lynda calls Laurie, but Michael strangles her with the telephone cord just as Laurie picks up. Meanwhile, Loomis discovers the stolen car and begins searching the streets.</p></div><div class='sectionFour'><p>Suspicious, Laurie goes over to the Wallace house, and finds the bodies of Annie, Bob, and Lynda, as well as Judith's headstone. She cowers in a hallway, where Michael suddenly appears and attacks her. Barely escaping, Laurie flees back to the Doyle house; Michael gets in, but she manages to fend him off long enough for Tommy and Lindsey to escape. Loomis sees the two children fleeing the house and goes to investigate, finding Michael and Laurie fighting upstairs. Loomis shoots Michael six times, once in the face, knocking him off the balcony; when Loomis goes to check, he finds Michael's body missing. Unsurprised, Loomis stares off into the night, while Laurie begins sobbing in terror.</p></div>"}
]
}

